Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes
The DetailMarkPropertyElementTypes class represents the available property element types for detail marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes.DetailName
Returns the detail name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes.SourceDrawingName
Returns the source drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes.SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Returns: The requested property element type.